# Дано натуральное число N и
# последовательность из N элементов.
# Требуется вывести эту последовательность в
# обратном порядке.
# Примечание. В программе запрещается
# объявлять массивы и использовать циклы
# (даже для ввода и вывода).
# Input: 2 -> 3 4
# Output: 4 3

def rev(n):
    if n==0:
        return '0'
    return f'{n}',rev(n-1)
n = int(input())
print(rev(n), sep=' ')

